const text = `Аленький цветочек: читать онлайн
Автор: Аксаков Сергей Тимофеевич
Примерное время прочтения: 20 мин
В некотором царстве, в некотором государстве жил богатый купец. Много у него было всякого добра: драгоценные камни, изящные ткани и ковры, золото и серебро, но самым большим его богатством были три дочери. Все три известные красавицы, а младшая дочь — лучше всех собой, да к тому же добрая и ласковая, потому купец и любил её больше остальных.

Собрался он как-то раз по делам за море, за тридевять земель, в тридевятое царство, в тридесятое государство, и говорит своим любимым дочерям:

— Дочери мои милые, дочери мои хорошие, дочери мои пригожие, еду я по своим купецким делам за тридевять земель, в тридевятое царство, тридесятое государство, и мало ли, много ли времени проезжу — не знаю. Я прошу вас жить без меня честно и смирно, а я привезу вам такие подарки, какие вы сами захотите.

Дал он им три дня подумать и сказать, каких подарков им хотелось бы больше всего. Думали девушки три дня и три ночи.

Перед самым отъездом отца старшая дочь поклонилась и говорит ему первая:

— Родной мой батюшка, не вези мне шелка, расшитые золотом и меха из черного соболя, ни жемчуг восточный, а хочу я золотой венец с драгоценными камнями, светящимися как солнышко красное, и чтобы светло было от венца и днем и ночью.

Купец подумал и сказал:

— Хорошо, дочь моя милая, привезу я тебе такой венец.

Поклонилась ему дочь средняя и говорит:

— Родной мой батюшка, не вези мне шелка, расшитые золотом и меха из черного соболя, ни жемчуг восточный, ни золотой венец с драгоценными камнями, а привези мне хрустальный столик с зеркальцем, чтобы, смотрясь в него я видела свою красоту и не старилась, а только хорошела с каждым днём.

Снова задумался купец и, подумав мало ли, много ли времени, сказал ей так:

— Хорошо, дочь моя милая, достану я тебе такой хрустальный столик.

Поклонилась отцу младшая дочь и говорит:

— Родной мой батюшка, не вези мне шелка, расшитые золотом и меха из черного соболя, ни жемчуг восточный, ни золотой венец с драгоценными камнями, ни хрустальный столик с зеркальцем, а привези ты мне цветочек аленький, которого бы краше не было на белом свете.

Задумался купец пуще прежнего. Мало ли, много ли времени он думал, неизвестно, а известно, что сказал он ей так:

— Ну, задала ты мне работу потяжелее сестер своих: когда знаешь, что искать, то как не найти, а как же найти то, чего сам не знаешь? Аленький цветочек не сложно найти, а как узнать, что краше его нет на белом свете? Буду стараться, дочь моя любимая.

И вот стал собираться купец в дорогу, долго ли собирался или нет, уже забыто: скоро сказка сказывается, да не скоро дело делается.

Ездит купец по странам заморским, покупает товары диковинные и отправляет их кораблями домой. Нашел он с легкостью подарок для старшей дочери, нашел и для средней, не может только отыскать заветный подарок для младшей, любимой дочери — аленького цветочка, краше которого не было бы на белом свете.

Находил он в царских и королевских садах много цветов такой красоты, что ни в сказке сказать, ни пером описать; но никто не смог ему обещать, что краше того цветка нет на белом свете; да он и сам так не думал.

Вот едет он путем-дорогой со своими слугами верными по пескам сыпучим, по лесам дремучим, и, откуда ни возьмись, налетели на него разбойники. Увидев беду неминуемую, бежит купец в темные леса. «Пусть лучше растерзают меня звери лютые, чем попасться в руки разбойников».

Бродит он по тем лесам дремучим, и что дальше идет, то дорога лучше становится, словно деревья перед ним расступаются, а кусты раздвигаются. Смотрит назад — руку не просунуть, смотрит направо — зайцу не проскочить, смотрит налево — и того хуже. Удивляется купец, а сам всё идет и идет.

Долго брел он по лесу, вот и звуков не слышно стало, ни птиц, ни зверей, тьма кругом, а под ногами светло. Вышел он наконец на поляну, а на ней стоит дворец королевский, весь в огне, в серебре и золоте и в драгоценных камнях, весь горит и светит словно солнышко красное, даже глазам тяжело на него смотреть. Все окошки во дворце открыты, и играет в нем музыка такая прекрасная, какой купец никогда ещё не слышал.

Заходит он на широкий двор по дороге из белого мрамора, видит фонтаны большие и малые. Заходит во дворец по лестнице, устланной красным ковром, с перилами, позолоченными; входит в комнату — нет никого; в другую, в третью — нет никого; в пятую, десятую — нет никого; а убранство везде королевское, неслыханное и невиданное: золото, серебро, хрусталь, кость слоновая и мамонтовая.

Удивляется купец такому богатству несказанному, а больше тому, что хозяина нет и прислуги нет; а музыка играет; и подумал он про себя: «Всё хорошо, да поесть нечего» — и вырос перед ним стол с посудой золотой и серебряной и блюдами заморскими. Сел он за стол, наелся досыта, потому что не ел целые сутки; кушанье такое, что и сказать нельзя, того и гляди, что язык проглотишь, а он крепко проголодался.

Удивляется купец такому чуду чудному и такому диву дивному, а сам думает: «Хорошо бы теперь поспать» — и видит, стоит перед ним кровать резная, из чистого золота, на ножках хрустальных, с пологом серебряным, с бахромой и кистями жемчужными; одеяло на ней как гора лежит, мягкое, пуховое. Удивляется купец такому чуду новому; ложится он на высокую кровать и думает: «Ах, хоть бы мне увидеть во сне дочерей!» — и засыпает в ту же минуту.

Проснулся купец, и опомниться не может: всю ночь видел он во сне дочерей своих. У старших женихи богатые и собираются они выйти замуж, не дождавшись его благословения отцовского; младшая же дочь любимая о женихах и слышать не хочет, пока не вернется ее родной батюшка. И стало у него на душе и радостно и не радостно.

Встал он с кровати высокой, оделся, покушал, а затем гуляя по дворцу, увидел в открытых окнах диковинный сад с цветами неописуемой красоты. Спускается он по лестнице из зеленого мрамора с позолоченными перилами прямо в зеленые сады. Гуляет и любуется: на деревьях висят спелые плоды, румяные, сами в рот так и просятся, глядя на них, слюнки текут; цветы цветут, махровые, пахучие, всякими красками расписанные; птицы летают невиданные: словно по зеленому бархату золотом и серебром выложенные, песни поют райские; фонтаны бьют высокие, даже смотреть на их вышину — голова кружится.

Ходил купец так много ли, мало ли времени — неизвестно: скоро сказка сказывается, не скоро дело делается. И вдруг видит он, на зеленом пригорке цветет цветок такого алого цвета, невиданной и неслыханной красоты, что ни в сказке сказать, ни пером описать. У купца дух занимается; подходит он к тому цветку; запах от цветка по всему саду словно струя бежит; затряслись и руки, и ноги у купца, и заговорил он радостным голосом:

— Вот аленький цветочек, которого нет краше на всём белом свете, о котором просила меня дочь младшая, любимая.

И, проговорив такие слова, он подошел и сорвал аленький цветочек. В ту же минуту, без всяких туч, блеснула молния и ударил гром, земля зашаталась под ногами, — и вырос, как будто из земли, перед купцом зверь не зверь, человек не человек, а какое-то чудище, страшное и мохнатое, и заревело голосом диким:

—Как ты посмел сорвать мой любимый цветок? Я хозяин дворца и сада, я принял тебя, как дорогого гостя, накормил, напоил и спать уложил, а ты так заплатил за мое добро?

У купца от страха зуб на зуб не попадал, он упал на колени перед чудищем мохнатым, и заговорил голосом жалобным:

— Ох, не губи меня, не прикажи казнить, прикажи слово вымолвить. А есть у меня три дочери, три дочери красавицы; обещал я им по подарку привезти: старшей дочери — венец, средней дочери — столик хрустальный, а младшей дочери — аленький цветочек, какого бы не было краше на белом свете. Старшим дочерям подарки я нашёл, а младшей дочери не мог найти; увидел я такой подарок у тебя в саду — аленький цветочек, какого краше нет на белом свете, и подумал я, что такому хозяину, богатому-богатому, славному и могучему, не будет жалко цветочка аленького, о котором просила моя младшая, любимая дочь. Прости меня и отпусти к дочерям. Обещаю я тебе богатства несметные.

Раздался по лесу хохот и сказало чудище:

— Не надо мне твоих богатств: мне своих девать некуда. Есть для тебя только одно спасенье. Я отпущу тебя домой невредимого, подарю цветочек аленький и награжу богатствами, если пришлешь ты вместо себя одну из дочерей своих. Скучно мне здесь одному.

Горючими слезами купец обливается и говорит голосом жалобным:

— А как мне быть, если дочери мои по своей воле не захотят ехать к тебе?

— Если дочери твои не поедут по своей воле, то сам приезжай, и велю я казнить тебя. А как приехать ко мне — не твоя беда; дам я тебе перстень: кто наденет его на правый мизинец, тот очутится там, где пожелает. Срока тебе даю дома пробыть три дня и три ночи.

Думал, думал купец и согласился, а что поделаешь. Как только надел перстень на правый мизинец, так очутился у себя дома. Поднялся в доме шум, встречали дочери отца своего с большой радостью. Видят только, что отец их как-то нерадостен и что на сердце у него печаль. Стали дочери его расспрашивать. И рассказал тогда купец своим дочерям родным и любимым, что с ним приключилось.

Старшие дочери наотрез отказались ехать со словами:

— Пусть та дочь и выручает отца, для кого он доставал аленький цветочек.

Стала перед купцом на колени младшая дочь, любимая, и сказала:

— Благослови меня, батюшка: я поеду к зверю лесному и стану жить у него. Для меня достал ты аленький цветочек, мне тебя и выручать.

Залился слезами купец, плачут в голос сестры старшие, а младшая сестра и виду не подаёт, в путь собирается.

Прошел третий день и третья ночь, пришла пора расставаться купцу, расставаться с дочерью любимой; целует он её, горючими слезами обливает. Вынимает перстень зверя лесного из ларца кованого, надевает на правый мизинец любимой дочери — и не стало ее в ту же минуту.

Очутилась девушка в том самом прекрасной дворце, в котором побывал её отец. Увидела своими глазами богатства огромные и сады прекрасные. А цветочек аленький сам прирос на прежнее место и зацвел пуще прежнего.

Вдруг на белой мраморной стене появились огненные слова:

«Я не буду тебе господином, а буду хорошим, верным другом. У тебя будет всё, что ты только пожелаешь».

Прочитала она слова, и пропали они со стены, как будто их никогда там и не было. И только пришло ей на ум написать письмо отцу, как видит бумага лежит, золотое перо с чернильницей. Написала родным девушка:

«Не плачьте, не горюйте, я живу во дворце у зверя лесного, как королевна; его не вижу и не слышу, а пишет он мне на стене словами огненными; и знает он всё, о чём я думаю, и в ту же минуту исполняет, и не хочет он называться господином моим, а хочет стать другом».

Не успела она письмо дописать, как пропало оно из рук и из глаз ее, словно его и не было. Заиграла музыка пуще прежнего, на столе появились блюда и напитки. После обеда, наевшись, она легла поспать; заиграла музыка тише и подальше — чтоб ей не мешать.

После сна встала девушка весёлая и пошла гулять по садам зеленым, потому что не успела она до обеда обходить и половины их, наглядеться на все их диковинки. Все деревья, кусты и цветы перед ней преклонялись, а спелые плоды — груши, персики и наливные яблочки — сами в рот лезли. Походив до вечера, вернулась она во дворец, а там уже столы накрыты.

Так день пошел за днем. Каждый день утром ждали её новые прекрасные наряды, вкусные угощенья, прекрасная музыка. С каждым днем всё чаще подходила девушка к стене мраморной, чтобы читать на стене слова от хозяина своего и самой говорить ему ласковые слова. Мало ли, много ли тому времени прошло: скоро сказка сказывается, да не скоро дело делается, — стала привыкать к своей такой жизни купеческая дочь и стало ей любопытно поговорить со зверем голосом, а не словами на стене.

Стала она его просить; да зверь лесной на просьбы не соглашается, испугать опасается. И вот однажды всё же согласился он и сказал:

— Приходи сегодня в сад в свою любимую беседку, листьями, ветками, цветами оплетенную, и скажи так: «Поговори со мной».

Побежала тогда девушка в сад к любимой беседке, сердце колотится, в пятки уходит. Прибежала, села на скамейку резную и сказала ласково:

— Не бойся, добрый друг, испугать меня своим голосом: после всех твоих милостей не побоюсь я и звериного рёва; говори со мной без опаски.

И услышала она голос страшный, дикий, хриплый и сиплый, да и то говорил он еще вполголоса. Вздрогнула молодая дочь купеческая, красавица писаная, испугалась, но вида не показала, и скоро умные его речи стала слушать она и заслушалась, и стало у неё на сердце тепло и радостно.

С той поры, с того времени пошли у них разговоры, считай, целыми днями в прекрасном зеленом саду. Только спросит молодая дочь купецкая, красавица писаная:

— Здесь ли ты, мой добрый друг?

Отвечает лесной зверь:

— Здесь, госпожа моя прекрасная, твой верный друг.

Прошло мало ли, много ли времени: скоро сказка сказывается, да не скоро дело делается, — захотелось девушке увидеть своими глазами зверя лесного и стала она его об этом просить.

Долго он не соглашается, испугать ее опасается, да и был он такое страшилище, что ни в сказке сказать, ни пером написать.

— Не проси, не моли меня, увидев меня, страшного и противного, возненавидишь ты меня, и прогонишь с глаз долой, а в разлуке с тобой я умру с тоски.

Не слушала таких речей молодая купеческая дочь, клялась, что никакого на свете страшилища не испугается и что не разлюбит друга своего сердечного.

Долго, долго лесной зверь не поддавался на такие слова, да не мог просьбам и слезам своей красавицы противиться, и сказал ей так:

— Не могу больше отказывать тебе по той причине, что люблю тебя больше самого себя. Возьми мой перстень золотой и, если моё общество станет тебе невыносимым, сможешь вмиг вернуться к своему отцу.

Не побоялась девушка, пошла в любимый сад и проговорила: «Покажись мне, мой верный друг!» — и показался ей издали зверь лесной: он прошел только поперек дороги и пропал в частых кустах; закричала от страха купеческая дочь и упала на дорогу без памяти, так страшен оказался зверь.

Придя в себя, услышала девушка возле себя плач, горючими слезами обливался зверь и говорил жалостным голосом:

— Погубила ты меня, моя красавица возлюбленная, не видеть мне больше твоего лица прекрасного, не захочешь ты меня даже слышать, и пришло время мне умереть.

Жалко стало девушке друга, совладала она со страхом и с своим сердцем робким, и заговорила голосом твердым:

— Нет, не бойся ничего, мой добрый друг, не испугаюсь я больше твоего вида; покажись мне снова.

Показался ей лесной зверь в своем виде страшном, противном, безобразном, только близко подойти к ней не осмелился, сколько она ни звала его; гуляли они до ночи темной и вели беседы прежние, ласковые и разумные, и не было никакого страха у купеческой дочери. Шли дни в долгих прогулках и скоро страх совсем прошел. Целыми днями не разлучались девушка и зверь.

И прошло так немало времени: скоро сказка сказывается, да не скоро дело делается. Вот однажды и приснилось купеческой дочери, что батюшке её нездоровится; и напала на нее тоска, и увидел ее в той тоске и слезах зверь лесной и стал спрашивать: отчего она в тоске, в слезах? Рассказала она ему свой сон и стала просить позволения повидать своего батюшку и сестер. И сказал ей зверь лесной:

— И зачем тебе мое позволенье? Золотой перстень мой у тебя лежит, надень его на правый мизинец и очутишься в доме у родного батюшки. Оставайся у него, пока не соскучишься, но только я скажу тебе: если ты ровно через три дня и три ночи не вернешься, то не будет меня на белом свете, и умру я в ту же минуту, по той причине, что люблю тебя больше, чем самого себя, и жить без тебя не могу.

И вот простилась она со зверем, надела на правый мизинец золотой перстень и очутилась в доме своего родного батюшки. А батюшка лежит болен и нерадостен, день и ночь ее вспоминая, горючими слезами обливаясь; и обрадовался он, увидавши свою дочь милую, хорошую, пригожую, младшую, любимую, и дивился он красоте ее девичьей, ее наряду королевскому.

Долго они разговаривали. Рассказала она своему батюшке и своим сестрам старшим, про свое житье-бытье у зверя лесного всё от слова до слова, ничего не скрывая. И порадовался купец ее житью богатому, королевскому, и дивился, как она привыкла смотреть на зверя лесного; сам он, о нем вспоминая, дрожью дрожал. Сестрам же старшим, слушая про богатства несметные младшей сестры, завистно стало.

День проходит, как единый час, другой день проходит, как минуточка, а на третий день стали уговаривать младшую сестру сестры старшие, чтоб не возвращалась она к зверю лесному. Рассердилась младшая сестра на старших и сказала им так:

— Если я моему другу за все его милости и любовь горячую заплачу его смертью, то не буду я стоить того, чтобы мне на белом свете жить, и стоит меня тогда отдать диким зверям на растерзание.

И отец похвалил ее за такие хорошие речи. А сестрам то завидно было, и задумали они дело хитрое и недоброе; взяли они да все часы в доме на целый час назад перевели, и не знал этого никто больше.

И когда пришел настоящий час, стало у молодой купеческой дочери, красавицы писаной, сердце болеть и щемить, словно стало что-нибудь подмывать ее, и смотрит она то и дело на часы отцовские, английские, немецкие, — а всё равно ей пускаться в дальний путь. А сестры с ней разговаривают, о том о сем расспрашивают, задерживают. Однако сердце ее не вытерпело; простилась дочь младшая, любимая, красавица писаная, с купцом, батюшкой, приняла от него благословение родительское, простилась с сестрами старшими, с прислугой верной, и, не дождавшись одной минуточки до часа урочного, надела золотой перстень на правый мизинец и очутилась во дворце зверя лесного, и, удивляясь, что он ее не встречает, закричала она громким голосом:

— Где же ты, мой верный друг? Что же ты меня не встречаешь? Я вернулась раньше срока.

Ни ответа, ни привета не было, тишина стояла мертвая; в зеленых садах птицы не пели песни райские, не били фонтаны и не играла музыка. Дрогнуло сердце у купеческой дочери, красавицы писаной, почуяла она недоброе; побежала в сад, звала своего друга доброго — нет нигде ни ответа, ни привета. Побежала она на пригорок, где рос, красовался ее любимый цветочек аленький, и видит она, что лесной зверь лежит на пригорке, обхватив аленький цветочек своими безобразными лапами. И показалось ей, что заснул он и спит теперь крепким сном. Начала его будить потихоньку, схватила за лапу мохнатую — и видит, что зверь лесной бездыханен, мертв лежит…

Подкосились ноги девушки, упала она на колени, обняла руками голову своего друга сердечного, голову безобразную и противную, и закричала:

— Встань, проснись, мой сердечный друг, я люблю тебя как жениха желанного!

И только слова эти она вымолвила, как заблестели молнии со всех сторон, затряслась земля от грома, ударила молния в пригорок, и упала без памяти купеческая дочь.

Очнувшись, видит она себя в палате высокой, мраморной, сидит она на золотом престоле и обнимает ее молодой, красавец принц, на голове с короной, в золотых одеждах; перед ними стоит отец с сестрами, а кругом на коленях стоит свита великая, все одеты в шелка золотые, серебряные. И говорит ей молодой принц:

— Полюбила ты меня, красавица ненаглядная, в образе чудища безобразного, за мою добрую душу и любовь к тебе; полюби же меня теперь в образе человеческом, будь моей невестой желанной. Злая волшебница разгневалась на моего отца покойного, славного и могучего короля, украла меня, еще маленьким, и колдовством своим, обратила меня в чудище страшное и наложила такое заклятие, что жить мне в таком виде безобразном, противном и страшном для всякого человека, пока не найдется красная девица, и не полюбит меня в образе страшилища и не пожелает быть моей женой законною, — и тогда колдовство всё закончится. Ты одна полюбила меня, чудище противное и безобразное, за мою душу добрую, за любовь мою к тебе несказанную, и будешь ты за это женой короля славного, королевой в царстве могучем.

Купец дал свое благословение дочери и молодому принцу-королевичу. И поздравили все жениха с невестой и немедля принялись веселым пирком да за свадебку, и стали жить поживать, да добра наживать.`;

const res = text.replace(/(?:\r\n|\r|\n)/g, ' ')
  .split(' ')
  .filter(Boolean)
  .map((w) => w.replace(/[^А-Яа-я]/g, ''))
  .filter(Boolean)
  .map((w) => w.toLowerCase());

console.log(JSON.stringify([...new Set(res)]));
